---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.GetOptions
source: html/79e15a6b-3a5d-3aa1-c13a-5155356c5842.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.GetOptions Method

Gets the collection of named options set by the exporter client.

## Syntax (C#)
```csharp
public IDictionary<string, string> GetOptions()
```

## Returns
The collection of named options.